# seattle accident severity prediction

About data set: this data is obtained from seattle geo data open source published by government about collison data since 2003 data contain numerous features along with our target feature accident severity .
in this notebook we will analyze the data to find some insights and we will predict the severity index by machine learning

In [38]:
import pandas as pd
import numpy as np

In [39]:
print('hello capstone project course!')

hello capstone project course!

In [40]:
#!wget -O data.csv "https://opendata.arcgis.com/datasets/5b5c745e0f1f48e7a53acec63a0022ab_0.csv"

In [41]:
df = pd.read_csv("data.csv")

In [42]:
df.tail()

,X,Y,OBJECTID,INCKEY,COLDETKEY,REPORTNO,STATUS,ADDRTYPE,INTKEY,LOCATION,...,ROADCOND,LIGHTCOND,PEDROWNOTGRNT,SDOTCOLNUM,SPEEDING,ST_COLCODE,ST_COLDESC,SEGLANEKEY,CROSSWALKKEY,HITPARKEDCAR
221733,-122.336431,47.689605,221734,321290,322790,E940737,Unmatched,Block,NaN,WALLINGFORD AVE N BETWEEN N 82ND ST AND N 85TH ST,...,NaN,NaN,NaN,NaN,NaN,,NaN,0,0,Y
221734,-122.379619,47.668051,221735,321732,323232,E944454,Matched,Block,NaN,BARNES AVE NW BETWEEN 17TH AVE NW AND NW MARKE...,...,Dry,Daylight,NaN,NaN,NaN,71,Same direction -- both turning right -- both m...,0,0,N
221735,-122.312837,47.526850,221736,321607,323107,3752879,Matched,Intersection,35099.0,16TH AVE S AND DALLAS AVE S,...,Dry,Daylight,NaN,NaN,NaN,10,Entering at angle,0,0,N
221736,-122.285051,47.567923,221737,321002,322502,E938673,Matched,Intersection,32686.0,38TH AVE S AND S ANDOVER ST,...,Dry,Daylight,NaN,NaN,Y,10,Entering at angle,0,0,N
221737,-122.363032,47.548385,221738,321629,323129,3692985,Matched,Block,NaN,DELRIDGE WAY SW BETWEEN SW JUNEAU ST AND 24TH ...,...,Wet,Daylight,NaN,NaN,NaN,32,One parked--one moving,0,0,N

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 221738 entries, 0 to 221737
Data columns (total 40 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   X                214260 non-null  float64
 1   Y                214260 non-null  float64
 2   OBJECTID         221738 non-null  int64
 3   INCKEY           221738 non-null  int64
 4   COLDETKEY        221738 non-null  int64
 5   REPORTNO         221738 non-null  object
 6   STATUS           221738 non-null  object
 7   ADDRTYPE         218024 non-null  object
 8   INTKEY           72027 non-null   float64
 9   LOCATION         217145 non-null  object
 10  EXCEPTRSNCODE    101335 non-null  object
 11  EXCEPTRSNDESC    11785 non-null   object
 12  SEVERITYCODE     221737 non-null  object
 13  SEVERITYDESC     221738 non-null  object
 14  COLLISIONTYPE    195287 non-null  object
 15  PERSONCOUNT      221738 non-null  int64
 16  PEDCOUNT         221738 non-null  int64
 17  PEDCYLCOUNT      221738 non-null  int64
 18  VEHCOUNT         221738 non-null  int64
 19  INJURIES         221738 non-null  int64
 20  SERIOUSINJURIES  221738 non-null  int64
 21  FATALITIES       221738 non-null  int64
 22  INCDATE          221738 non-null  object
 23  INCDTTM          221738 non-null  object
 24  JUNCTIONTYPE     209759 non-null  object
 25  SDOT_COLCODE     221737 non-null  float64
 26  SDOT_COLDESC     221737 non-null  object
 27  INATTENTIONIND   30188 non-null   object
 28  UNDERINFL        195307 non-null  object
 29  WEATHER          195097 non-null  object
 30  ROADCOND         195178 non-null  object
 31  LIGHTCOND        195008 non-null  object
 32  PEDROWNOTGRNT    5195 non-null    object
 33  SDOTCOLNUM       127205 non-null  float64
 34  SPEEDING         9936 non-null    object
 35  ST_COLCODE       212325 non-null  object
 36  ST_COLDESC       195287 non-null  object
 37  SEGLANEKEY       221738 non-null  int64
 38  CROSSWALKKEY     221738 non-null  int64
 39  HITPARKEDCAR     221738 non-null  object
dtypes: float64(5), int64(12), object(23)
memory usage: 67.7+ MB

In [44]:
sorted_df = df[['X', 'Y','WEATHER','ROADCOND','LIGHTCOND','SPEEDING','SEVERITYCODE', 'UNDERINFL','SERIOUSINJURIES','FATALITIES','INJURIES','PERSONCOUNT','PEDCOUNT','PEDCYLCOUNT','VEHCOUNT']]
sorted_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 221738 entries, 0 to 221737
Data columns (total 15 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   X                214260 non-null  float64
 1   Y                214260 non-null  float64
 2   WEATHER          195097 non-null  object
 3   ROADCOND         195178 non-null  object
 4   LIGHTCOND        195008 non-null  object
 5   SPEEDING         9936 non-null    object
 6   SEVERITYCODE     221737 non-null  object
 7   UNDERINFL        195307 non-null  object
 8   SERIOUSINJURIES  221738 non-null  int64
 9   FATALITIES       221738 non-null  int64
 10  INJURIES         221738 non-null  int64
 11  PERSONCOUNT      221738 non-null  int64
 12  PEDCOUNT         221738 non-null  int64
 13  PEDCYLCOUNT      221738 non-null  int64
 14  VEHCOUNT         221738 non-null  int64
dtypes: float64(2), int64(7), object(6)
memory usage: 25.4+ MB

study indiviual fetures

In [45]:
#sorted_df.dropna(subset=['LIGHTCOND'],axis = 0,inplace = True)
#sorted_df.dropna(subset=['UNDERINFL'],axis = 0,inplace = True)
#sorted_df.dropna(subset=['WEATHER'],axis = 0,inplace = True)
#sorted_df.dropna(subset=['ROADCOND'],axis = 0,inplace = True)

In [46]:
sorted_df['WEATHER'].value_counts().to_frame()

                          WEATHER
Clear                      114807
Raining                     34038
Overcast                    28556
Unknown                     15131
Snowing                       919
Other                         860
Fog/Smog/Smoke                577
Sleet/Hail/Freezing Rain      116
Blowing Sand/Dirt              56
Severe Crosswind               26
Partly Cloudy                  10
Blowing Snow                    1

In [47]:
sorted_df['ROADCOND'].value_counts().to_frame()

                ROADCOND
Dry               128660
Wet                48737
Unknown            15139
Ice                 1232
Snow/Slush          1014
Other                136
Standing Water       119
Sand/Mud/Dirt         77
Oil                   64

In [48]:
sorted_df['SPEEDING'].value_counts().to_frame()

   SPEEDING
Y      9936

In [49]:
sorted_df['LIGHTCOND'].value_counts().to_frame()

                          LIGHTCOND
Daylight                     119555
Dark - Street Lights On       50139
Unknown                       13533
Dusk                           6085
Dawn                           2609
Dark - No Street Lights        1580
Dark - Street Lights Off       1239
Other                           244
Dark - Unknown Lighting          24

In [50]:
sorted_df['SEVERITYCODE'].value_counts().to_frame()

    SEVERITYCODE
1         137776
2          58842
0          21656
2b          3111
3            352

In [51]:
sorted_df['SERIOUSINJURIES'].value_counts().to_frame()

    SERIOUSINJURIES
0            218624
1              2946
2               133
3                23
4                 6
5                 5
41                1

In [52]:
sorted_df['FATALITIES'].value_counts().to_frame()

   FATALITIES
0      221386
1         334
2          14
3           2
5           1
4           1

In [53]:
sorted_df['PERSONCOUNT'].value_counts().to_frame()

    PERSONCOUNT
2        119210
3         36577
0         25027
4         15029
1         13960
5          6800
6          2796
7          1180
8           547
9           227
10          133
11           59
12           35
13           22
14           22
15           11
17           11
16            8
44            6
20            6
25            6
18            6
19            6
22            5
29            4
26            4
23            3
32            3
47            3
27            3
28            3
37            3
34            3
21            2
36            2
31            2
30            2
24            2
35            1
81            1
39            1
41            1
43            1
48            1
53            1
54            1
57            1
93            1

In [54]:
sorted_df['PEDCOUNT'].value_counts().to_frame()

   PEDCOUNT
0    213662
1      7761
2       275
3        28
4         9
5         2
6         1

In [55]:
sorted_df['PEDCYLCOUNT'].value_counts().to_frame()

   PEDCYLCOUNT
0       215724
1         5963
2           51

In [56]:
sorted_df['VEHCOUNT'].value_counts().to_frame()

    VEHCOUNT
2     150426
1      27922
0      26675
3      13387
4       2525
5        557
6        153
7         53
8         18
9         10
11         6
10         2
15         1
14         1
13         1
12         1

In [57]:
sorted_df['UNDERINFL'].value_counts().to_frame()

   UNDERINFL
N     104002
0      81676
Y       5399
1       4230

In [ ]:
sorted_df =